read_verilog -netlist ./simd_netlist.v
current_design simd_top_level
read_sdc ./simd_sdc.sdc
