read_verilog -netlist ./simd_netlist_scan_lamp.v
current_design simd_top_level
read_sdc ./simd_scan_sdc.sdc
